DataProcessors/ПроведениеРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПроведениеРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыДнейКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДнейКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПроведениеРегламентныхОпераций/Forms/ВыборПериода/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Период = ЭтаФорма.Параметры.Период;
	
	ЭтаФорма.РежимУчетаРабочихДней = 0; // только перезаполнение
	ЭтаФорма.Календарь = Справочники.Календари.Общероссийский;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимУчетаРабочихДнейПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиРегистрацииЗаУказанныйПериод(Период, РежимУчетаРабочихДней, Календарь)
	
	НаборДат = Новый Массив;
	
	Если РежимУчетаРабочихДней = 1 Тогда // только рабочие дни и конец каждого месяца
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|			ИЛИ КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ))
			|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
		
		Запрос.УстановитьПараметр("Календарь", Календарь);
		Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			НаборДат.Добавить(Выборка.Дата);
		КонецЦикла;
			
	ИначеЕсли РежимУчетаРабочихДней = 2 Тогда // только рабочие дни
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &Календарь
			|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
		
		Запрос.УстановитьПараметр("Календарь", Календарь);
		Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
		
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			НаборДат.Добавить(Выборка.Дата);
		КонецЦикла;
		
	ИначеЕсли РежимУчетаРабочихДней = 3 Или РежимУчетаРабочихДней = 0 Тогда // все дни
		ДатаПериода = Период.ДатаНачала;
		Пока ДатаПериода <= Период.ДатаОкончания Цикл
			НаборДат.Добавить(ДатаПериода);
			ДатаПериода = ДатаПериода + 86400;
		КонецЦикла;
		
	Иначе
		ВызватьИсключение "Получение набора дат по данному режиму не поддерживается";
		
	КонецЕсли;
	
	СоздаватьНедостающие = (РежимУчетаРабочихДней > 0);
	
	НастройкиРегистрацииЗаПериод = Новый Структура("НаборДат, СоздаватьНедостающие, ПерезаполнитьБезУчетаНастроекРегламентныхДействий", НаборДат, СоздаватьНедостающие, РежимУчетаРабочихДней = 0);
	
	Если РежимУчетаРабочихДней = 0 Тогда
		
		НастройкиРегистрацииЗаПериод.Вставить("ТекстВопроса", 
			"Подтвердите, пожалуйста, перезаполнение документов за период с " + 
			Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
	КонецЕсли; 
	
	Возврат НастройкиРегистрацииЗаПериод;
	
КонецФункции // ПолучитьНастройкиРегистрацииЗаУказанныйПериод

&НаКлиенте
Процедура РежимУчетаРабочихДнейПриИзменении(Элемент)
	
	Элементы.Календарь.Видимость = (ЭтаФорма.РежимУчетаРабочихДней = 1 Или ЭтаФорма.РежимУчетаРабочихДней = 2);
	Элементы.ДекорацияСправка.Видимость = (ЭтаФорма.РежимУчетаРабочихДней = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОК");
	Попытка
		ВыполнитьОК(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОК(ПараметрыСессии)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтаФорма.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Период");
		ПараметрыСессии.ТекстОшибки = ТекстСообщения;
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(
			ПолучитьНастройкиРегистрацииЗаУказанныйПериод(ЭтаФорма.Период, ЭтаФорма.РежимУчетаРабочихДней, ЭтаФорма.Календарь));
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
